### DataFrame class

In [227]:
d = {'col1':[1,2] ,'col2':[3,4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [231]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" :[0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [ ]:
df.values
df.columns
df.index

In [232]:
df.index.name='도시'
df.columns.name ='특성'
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [233]:
df.dtypes

특성
지역                object
2015               int64
2010               int64
2005               int64
2000               int64
2010-2015 증가율    float64
dtype: object

In [134]:
df2 = df.T # 행렬전환
df2

           서울       부산       인천        대구
지역        수도권      경상권      수도권       전라권
2015  9904312  3448737  2890451   2466052
2010  9631482  3393191  2632023   2121211
2005  9762222   111111  1111111  11111111

In [135]:
df2['부산']=df2['부산'] * 2 #갱신
df2

           서울       부산       인천        대구
지역        수도권   경상권경상권      수도권       전라권
2015  9904312  6897474  2890451   2466052
2010  9631482  6786382  2632023   2121211
2005  9762222   222222  1111111  11111111

In [140]:
df['2005~2010증가율'] = ((df['2010'] - df['2005']) / df['2005'] * 100).round(2)
df

     지역     2015     2010      2005  2005~2010증가율
서울  수도권  9904312  9631482   9762222         -1.34
부산  경상권  3448737  3393191    111111       2953.87
인천  수도권  2890451  2632023   1111111        136.88
대구  전라권  2466052  2121211  11111111        -80.91

In [143]:
df['지역'] # 지역 column의 값을 봄
df[['지역']] # 지역 column dataframe 형태로 봄 
df[['2010','2015']] # 2010 2015 column의 값을 봄

서울    수도권
부산    경상권
인천    수도권
대구    전라권
Name: 지역, dtype: object

In [154]:
import numpy as np
df3 = pd.DataFrame(np.arange(12).reshape(3,4))
df3
print(df3[0]) # 1열만 뽑아줌

0    0
1    4
2    8
Name: 0, dtype: int32

### DataFrame row 슬라이싱

In [188]:
df[:2] # 1행,2행 출력
df[['지역','2015']][:3]# 1~3행 지역,2015칼럼 출력

     지역     2015
서울  수도권  9904312
부산  경상권  3448737
인천  수도권  2890451

In [189]:
type(df[['지역','2015']][:3])

pandas.core.frame.DataFrame

In [190]:
df['2015'][:1]

서울    9904312
Name: 2015, dtype: int64

In [191]:
type(df['2015'][:1])

pandas.core.series.Series

In [192]:
df['2015']['서울']

9904312

In [193]:
type(df['2015']['서울'])

numpy.int64

In [ ]:
df[1:2] ## == df['부산':'부산']

In [269]:
data = {
 "국어": [80, 90, 70, 30],
 "영어": [90, 70, 60, 40],
 "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70